console.log('Самооценка - 100/100:');

console.log('1. Вёрстка страницы Main соответствует макету при ширине экрана 1280px: +14');
console.log('2. Вёрстка страницы Main соответствует макету при ширине экрана 768px: +14');
console.log('3. Вёрстка страницы Main соответствует макету при ширине экрана 320px: +14');
console.log('4. Вёрстка страницы Pets соответствует макету при ширине экрана 1280px: +6');
console.log('5. Вёрстка страницы Pets соответствует макету при ширине экрана 768px: +6');
console.log('6. Вёрстка страницы Pets соответствует макету при ширине экрана 320px: +6');
console.log('7. Ни на одном из разрешений до 320px включительно не появляется горизонтальная полоса прокрутки, справа от отдельных блоков не появляются белые поля. Весь контент страницы при этом сохраняется: не обрезается и не удаляется: +20');
console.log('8. Верстка резиновая: при плавном изменении размера экрана от 1280px до 320px верстка подстраивается под этот размер, элементы верстки меняют свои размеры и расположение, не наезжают друг на друга, изображения могут менять размер, но сохраняют правильные пропорции: +8');
console.log('9. При ширине экрана меньше 768px на обеих страницах меню в хедере скрывается, появляется иконка бургер-меню: +4');
console.log('6. Верстка обеих страниц валидная: для проверки валидности вёрстки используйте сервис: +8');